using System;

namespace T05.Coins
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //чете сума ресто 
            double changeToReturn = double.Parse(Console.ReadLine());
            changeToReturn *= 100; //преобразуване на монетите в цели числа
            int count = 0; //променлива за брояч на монети
            //изчисляване с колко най-малко монети може да се върне рестото 
            //монети
            //2, 1.00, 0.50, 0.20, 0.10, 0.05, 0.02, 0.01
            //създаване на цикъл, при който при всяко изпълнение се връща най-голямата монета
            //цикълът се върти, докато не върнем цялата сума
            while(changeToReturn > 0)//върти се, докато рестото не стане равно или по-малко от 0
            {
                if(changeToReturn>=200)//проверка дали рестото е по-голямо или равно на 200(най-голямата монета)
                {
                    changeToReturn -= 200;//от рестото се изважда монета от 2лв 
                    count++; //броячът за монети се увеличава
                }
                else if (changeToReturn >= 100)//ако рестото е по-голямо от монета 1лв
                {
                    changeToReturn -= 100;//от рестото се изважда монета от 1лв
                    count++; //броячът за монети се увеличава
                }
                else if (changeToReturn >= 50)//ако рестото е по-голямо от монета 50ст
                {
                    changeToReturn -= 50;//от рестото се изважда монета от 50ст
                    count++; //броячът за монети се увеличава
                }
                else if (changeToReturn >= 20)//ако рестото е по-голямо от монета 20ст
                {
                    changeToReturn -= 20;//от рестото се изважда монета от 20ст
                    count++; //броячът за монети се увеличава
                }
                else if (changeToReturn >= 10)//ако рестото е по-голямо от монета 10ст
                {
                    changeToReturn -= 10;//от рестото се изважда монета от 10ст
                    count++; //броячът за монети се увеличава
                }
                else if (changeToReturn >= 5)//ако рестото е по-голямо от монета 5ст
                {
                    changeToReturn -= 5;//от рестото се изважда монета от 5ст
                    count++; //броячът за монети се увеличава
                }
                else if (changeToReturn >= 2)//ако рестото е по-голямо от монета 2ст
                {
                    changeToReturn -= 2;//от рестото се изважда монета от 2ст
                    count++; //броячът за монети се увеличава
                }
                else if (changeToReturn >= 1)//ако рестото е по-голямо от монета 1ст
                {
                    changeToReturn -= 1;//от рестото се изважда монета от 1ст
                    count++; //броячът за монети се увеличава
                }
                else
                {
                    changeToReturn = 0;
                }
            }

            Console.WriteLine(count);
            //отпечатване на броя на монетите
        }
    }
}
